## Data Visualization Class 2: SQL Review
This is a rewrite of the "DATAAVS210_L02-Student Notes.docx" class handout from January 22, 2018.  I felt there was good material covered in the slides, but I wasn't able to actually follow along and do the exercises in class.  In this notebook I re-created the data tables as CDV files, show how to load them into a sqlite3 DB and then run the queries shown in the slides.  I have attempted to replicate the content of the slides as accurately as possible however, **table and column names are all in lower_case form, rather than the mixed case "CamelCase" format of the original notes.**

### Goals: 
The stated class goals for this lecture were - **"to revisit some basic concepts of SQL and write basic SQL queries using the proper syntax".**

### Prerequisites:
1. Download and install SQLite3. __[*Instructions Here*](https://github.com/lagerratrobe/data_science/blob/master/cert_class/DV_2/sql_review/SQLite3%20Installation.ipynb)__
2. Load the CSV files contained in this repo into a new DB named "DV2.db" __[*Instructions here*](https://github.com/lagerratrobe/data_science/blob/master/cert_class/DV_2/sql_review/Loading%20Data%20from%20CSV%20into%20SQLite3.ipynb)__

I've chosen to use SQLite (Version 3) as the means of implementing these SQL examples because it is free, easy to install and available for Mac, Linux and Windows.  SQLite is a lightweight, file-based, relational database engine.  It claims to be the "most used database engine in the world" and while it lacks some of the fetures found in more complex databses like PostgreSQL or Microsoft SQL Server, it is more than capable of executing these queries.  As an added bonus, it's also very easy to connect to a SQLite DB from within R using the RSQLite library.

### Load the DV2.db into sqlite3 and begin

```
sqlite3.exe DV2.db
SQLite version 3.20.1 2017-08-24 16:21:36
Enter ".help" for usage hints.
```

#### I. Check that you have all the tables needed for the exercise and begin.
```
sqlite> .tables
artists        books          order_details  pc
authors        laptops        orders         products
```

### Basic SQL Review

#### 2.0 Simple SELECT statement
- Input table: "pc"
- Question:
  - __*Write a query to show all values in a table*__
- Structure:

```
    SELECT *
    FROM <some_table_name>;
```
- Example:

```
    SELECT *
    FROM pc;
```
- Expected Output:

```
    id                model             ram               price
----------------  ----------------  ----------------  ----------------
1                 1232              64                600.00
2                 1121              128               850.00
3                 1233              32                400.00
```
**NOTE: ** If your output is not formatted similarly, make sure you run the following commands to set your sqlite environment. See Step 2 in Prerequisites section above.

```
sqlite> .mode column
sqlite> .width 16 16 16 16 16
sqlite> .headers on
```

#### 2.1 SELECT only specific columns from a table
- Input table: "pc"
- Question:
  - __*List all columns of the input table except "price"*__
- Structure:

```
    SELECT <some_column_name>,
    <some_column_name>
    FROM <some_table_name>;
```
- Query:

```
    SELECT ____,
    ____,
    ____
    FROM ____;
```
- Expected Output:

```
id                model             ram
----------------  ----------------  ----------------
1                 1232              64
2                 1121              128
3                 1233              32
```

#### 2.2a SELECT statement with WHERE clause
- Input table: "pc"
- Question:
  - __*Write a query to find model number, RAM and price for all PCs with prices over $500*__
- Structure:

```
    SELECT <some_column_name>,
    <some_column_name>
    FROM <some_table_name>
    WHERE <some_condition>;
```
- Query:

```
    SELECT ____,
    ____,
    FROM ____
    WHERE ____;
```
- Expected Output:

```
model             ram               price
----------------  ----------------  ----------------
1232              64                600.00
1121              128               850.00     
```

#### 2.2b SELECT statement with multiple WHERE clauses
- Input table: "pc"
- Question:
  - __*Write a query to find all rows where RAM is higher than 32 and price is under $800*__
- Structure:

```
    SELECT *
    FROM <some_table_name>
    WHERE <some_condition> <AND, OR>
    <some_other_condition>;
```
- Query:

```
    SELECT ____
    FROM ____
    WHERE ____ AND
    ____;
```
- Expected Output:

```
id                model             ram               price
----------------  ----------------  ----------------  ----------------
1                 1232              64                600.00     
```

#### 2.3a SELECT with GROUP BY statement
- Input table: "artists"
- Question:
  - __*List all artists (aka 'singers') and their total sales*__
- Structure:

```
    SELECT <some_column_name>,
    <some_column_name>
    FROM <some_table_name>
    GROUP BY <some_column_name>;
```
- Query:

```
    SELECT ____,
    SUM(____) AS total_sales
    FROM ____
    GROUP BY ____;
```
- Expected Output:

```
singer            total_sales
----------------  ----------------
Drowning Pool     1700000
Massive Attack    5400000
The Prodigy       2400000  
``` 
**NOTE:** This query also introduces the concept of aggregation by using the SUM function. The GROUP BY statement is often used with aggregate functions (COUNT, MAX, MIN, SUM, AVG) to group the result-set by one or more columns.

The concept of name aliasing using AS is also shown in this example. Aliases are used to give a table, or a column in a table, a temporary name which is displayed in the results.

#### 2.3b SELECT with GROUP BY statement
- Input table: "artists"
- Question:
  - __*List all artists (aka 'singers') and their most recent album year*__
- Structure:

```
    SELECT <some_column_name>,
    <some_column_name>
    FROM <some_table_name>
    GROUP BY <some_column_name>;
```
- Query:

```
    SELECT ____,
    MAX(____) AS ____
    FROM ____
    GROUP BY ____;
```
- Expected Output:

```
singer            last_album_year
----------------  ----------------
Drowning Pool     2013
Massive Attack    2004
The Prodigy       2008
```

#### 2.4a Filtering SELECT results using the HAVING clause
- Input table: "artists"
- Question:
  - __*List all artists (aka 'singers') who have sold more than 2,000,000 albums*__
- Structure:

```
    SELECT <some_column_name>,
    <some_column_name>
    FROM <some_table_name>
    GROUP BY <some_column_name>
    HAVING <some_specific_condition>;
```
- Query:

```
    SELECT ____,
    SUM(____) AS ____
    FROM ____
    GROUP BY ____
    HAVING ____ > 2000000;
```
- Expected Output:

```
singer            total_sales
----------------  ----------------
Massive Attack    5400000
The Prodigy       3300000
``` 
**NOTE:** The HAVING clause in SQL specifies that a SQL SELECT statement should only return rows where aggregate values meet the specified conditions. It was added to the SQL language because the WHERE keyword could not be used with aggregate functions.

#### 2.4b More filtering SELECT results using the HAVING clause
- Input table: "artists"
- Question:
  - __*List all artists (aka 'singers') whose oldest album was before 1998*__
- Structure:

```
    SELECT <some_column_name>,
    <some_column_name>
    FROM <some_table_name>
    GROUP BY <some_column_name>
    HAVING <some_specific_condition>;
```
- Query:

```
    SELECT ____,
    ____(____) AS ____
    FROM ____
    GROUP BY ____
    HAVING ____ < ____;
```
- Expected Output:

```
singer            oldest_album_yea
----------------  ----------------
The Prodigy       1994
```

#### 2.5a Using LEFT OUTER JOIN with WHERE clause to join 2 tables together

- Input tables: "products", "laptops"

```
products;
maker             model             type
----------------  ----------------  ----------------
a                 1298              Laptop
b                 1321              Laptop
c                 1750              Laptop
a                 1752              Laptop
d                 1288              Laptop
e                 2113              PC
f                 7777              Laptop

laptops;
id                model             speed             ram               hdd
----------------  ----------------  ----------------  ----------------  ----------------
1                 1298              350               32                4
2                 1321              500               54                64
3                 1750              750               128               12
4                 1288              600               64                10
5                 1752              750               128               10
```

- Question:
  - __*List the maker, model number, type, speed, ram and hdd for all laptops*__
  
- Structure:

```
    SELECT <table_a>.<some_column_name>,
    <table_a>.<some_column_name>,
    <table_b>.<some_column_name>
    FROM <left_table>  <--------------- (usually <table_a>)
    LEFT OUTER JOIN <right_table> <---- (usually <table_b>)
    ON <table_a>.<common_column_name> = <table_b>.<common_column_name>
    WHERE <some_specific_condition>;
```
- Query:

```
    SELECT products.maker, 
    products.model, 
    products.type, 
    laptops.speed, 
    laptops.ram, 
    laptops.hdd 
    FROM products 
    LEFT OUTER JOIN laptops 
    ON products.model = laptops.model 
    WHERE products.type = 'Laptop';
```
- Expected Output:

```
maker             model             type              speed             ram               hdd
----------------  ----------------  ----------------  ----------------  ----------------  ----------------
a                 1298              Laptop            350               32                4
b                 1321              Laptop            500               54                64
c                 1750              Laptop            750               128               12
a                 1752              Laptop            750               128               10
d                 1288              Laptop            600               64                10
f                 7777              Laptop
```
**NOTE:** The WHERE clause is needed at the end of this query to ensure that only 'Laptop' types are selected from the "products" table.  Without it, the results would include a PC row as well.  This is because the LEFT OUTER JOIN will return all values from the LEFT table, which in this case is "products".  See results of the same query below without the WHERE clause.

```
sqlite> SELECT products.maker, products.model, products.type, laptops.speed, laptops.ram, laptops.hdd FROM products LEFT OUTER JOIN laptops ON products.model = laptops.model;

maker             model             type              speed             ram               hdd
----------------  ----------------  ----------------  ----------------  ----------------  ----------------
a                 1298              Laptop            350               32                4
b                 1321              Laptop            500               54                64
c                 1750              Laptop            750               128               12
a                 1752              Laptop            750               128               10
d                 1288              Laptop            600               64                10
e                 2113              PC   <--------- included because no WHERE clause present
f                 7777              Laptop
```

The easy way to ensure that only values contained in the "laptops" table are returned is to reverse the position of table_a and table_b in the JOIN definition.  By placing "laptops" in the LEFT position, we can ensure that only results contained in that table are returned, without having to specify a WHERE clause.  See below.

```
sqlite> SELECT products.maker, products.model, products.type, laptops.speed, laptops.ram, laptops.hdd FROM laptops LEFT OUTER JOIN products ON laptops.model = products.model;

maker             model             type              speed             ram               hdd
----------------  ----------------  ----------------  ----------------  ----------------  ----------------
a                 1298              Laptop            350               32                4
b                 1321              Laptop            500               54                64
c                 1750              Laptop            750               128               12
d                 1288              Laptop            600               64                10
a                 1752              Laptop            750               128               10
```

However, doing this will also mean that the "product" table entry for model '7777' is excluded.  This is because there is no corresponding "model" entry in the "laptops" table for it.  The moral of the story is that the LEFT OUTER JOIN returns everything from the LEFT table, unless you restrict it.  Use this to your advantage, or at least be aware of it.

#### 2.5b Using LEFT OUTER JOIN with IN clause to join 2 tables together

- Input tables: "products", "laptops"

- Question:
  - __*List all the laptops made by Maker 'a' and 'b', include maker, model, id, speed, ram and hdd columns*__
  
- Structure:

```
    SELECT <table_a>.<some_column_name>,
    <table_a>.<some_column_name>,
    <table_b>.<some_column_name>
    FROM <left_table>  <--------------- (usually <table_a>)
    LEFT OUTER JOIN <right_table> <---- (usually <table_b>)
    ON <table_a>.<common_column_name> = <table_b>.<common_column_name>
    WHERE <some_specific_condition>;
```
- Query:

```
    SELECT ____, 
    ____, 
    ____, 
    ____, 
    ____, 
    ____ 
    FROM ____ 
    LEFT OUTER JOIN ____ 
    ON ____ = ____
    WHERE ____ = 'Laptop'
    AND ____ in ('a', 'b');
```
- Expected Output:

```
maker             model             type              speed             ram               hdd
----------------  ----------------  ----------------  ----------------  ----------------  ----------------
a                 1298              Laptop            350               32                4
b                 1321              Laptop            500               54                64
a                 1752              Laptop            750               128               10
```

**NOTE: ** The IN operator allows you to specify multiple values in a WHERE clause.  It is a shorthand for multiple OR conditions.  The query above could be re-written to use OR clauses like this.

```
    SELECT ____, 
    ____, 
    ____, 
    ____, 
    ____, 
    ____ 
    FROM ____ 
    LEFT OUTER JOIN ____ 
    ON ____ = ____
    WHERE ____ = 'Laptop'
    AND ____ = 'a'
    OR ____ = 'b';
```

#### 2.6a Using INNER JOIN to join 2 tables together

- Input tables: "authors", "books"

```
authors;
author_id         author_name
----------------  ----------------
1                 Bruce Eckel
2                 Robert Lafore
3                 Andrew Tannenbaum

books;
book_id   book_name                 author_id
--------  ------------------------  ----------------
101       Modern Operating System   3
102       Thinking in Java          1
104       Programming in Scala      5
```

- Question:
  - __*List the author_id, author_name, book_id and book_name for all authors who have a book*__
  
- Structure:

```
    SELECT <table_a>.<some_column_name>,
    <table_a>.<some_column_name>,
    <table_b>.<some_column_name>
    FROM <table_a>  
    INNER JOIN <table_b> 
    ON <table_a>.<common_column_name> = <table_b>.<common_column_name>;
```
- Query:

```
    SELECT a.author_id, 
    a.author_name, 
    b.book_id, 
    b.book_name 
    FROM authors a 
    INNER JOIN books b 
    ON a.author_id = b.author_id;
```
- Expected Output:

```
author_id         author_name               book_id           book_name
----------------  ------------------------  ----------------  ------------------------
1                 Bruce Eckel               102               Thinking in Java
3                 Andrew Tannenbaum         101               Modern Operating System
```

**NOTE: ** As SQL statements get longer and more complicated, it is useful to alias the table names to reduce the amount of typing you have to do and also to have less text on the screen.  This is done by using the syntax shown below:

```
    FROM authors a 
    INNER JOIN books b 
```
The "authors" table is aliased to "a" and the "books" table is aliased to "b".

#### 2.6b Using INNER JOIN to join 2 tables together

- Input tables: "orders", "order_details"

```
                    orders
order_id          order_total               item_id
----------------  ------------------------  ----------------
1                 100                       123
2                 200                       124
3                 300                       126

                    order_details
item_id           item_desc                 item_qty
----------------  ------------------------  ----------------
123               Spacecraft                1
124               Jets                      2
125               Solar Panels              1
```

- Question:
  - __*List order_id, order_total, item_id, item_desc, and item_qty for all orders that have a corresponding entry in the order_details table*__
  
- Structure:

```
    SELECT <table_a>.<some_column_name>,
    <table_a>.<some_column_name>,
    <table_b>.<some_column_name>
    FROM <table_a>  
    INNER JOIN <table_b> 
    ON <table_a>.<common_column_name> = <table_b>.<common_column_name>;
```
- Query:

```
    SELECT o.order_id, 
    o.order_total, 
    i.item_id, 
    i.item_desc, 
    i.item_qty 
    FROM orders o 
    INNER JOIN order_details i 
    ON o.item_id = i.item_id;
```
- Expected Output:

```
order_id          order_total               item_id           item_desc                 item_qty
----------------  ------------------------  ----------------  ------------------------  ----------------
1                 100                       123               Spacecraft                1
2                 200                       124               Jets                      2
```

**NOTE: ** It makes no difference with an INNER JOIN which table is on the LEFT or RIGHT of the join.  Only records for which each table has a matching common_column (or key) value will be returned.